[{"category":"Collection-e","subcategory":"Availability","feedback":"The reasons I gave for retaining Factiva are: 1) It is a research tool with Boolean searching <URL>ere is no similar alternative. Proquest does not contain local news articles. 2) NLB keeps promoting SURE campaigns but by removing factiva which contain multiple news sources both worldwide and local, patrons have lost 1 useful resource to improve information literacy. 3) Factiva database subscription is exorbitant. Only full-time students and faculty members in tertiary education get access to it. With the government promoting lifelong learning, NLB is doing a public good by providing access to quality databases for adults who've finished their tertiary education but want to continue learning. I am unsure whether the NLB staff communicating with me have used Factiva before or just replied to me based on the description on NLB website. Thealternatives like Newslink and newspapers SG only contain SPH publications. The <DATE_TIME> newspapers in newspapers sg contains pdf copies of <DATE_TIME> newspapers which have been long discontinued. Today is now a digital only publication. Factiva has current new articles from various local sources like channel news asia, sph news and today. Pressreader and SPH newspaper via NLB app are for casual readers who want to follow the news daily. It doesn't facilitate research. Factiva can search news by date, source and authors. I have attached some screenshots below. I hope someone from NLB can take the time to explore what Factiva can do rather than deciding solely based on cost benefits analysis."},{"category":"Collection-e","subcategory":"Others","feedback":"<DATE_TIME> I went to library. Use computer to log in press reader t hat one magazine has a lady topless don't know must inform u"},{"category":"Collection-Print","subcategory":"Availability","feedback":"<DATE_TIME> I checked the availability of books on this site before making the journey to the Jurong Regional library. When I reached the library 2 of the books were not there. I checked the site again which showed both books should still be available. The library staff helped me and confirmed the books were missing. It's frustrating to make the journey to find the books missing. This has also happened at Vivo on another occasion. Again the library staff could not explain the error. I also noticed the site often shows a book at a particular library noting it's unavailable. It remains on this status for <DATE_TIME>. It's also the only library with this book. Clearly the book is lost and not available anywhere else. Frustrating. How does the system manage these anomalies? Perhaps some improvements could be made to have the physical and system stock reconciled."},{"category":"Collection-Print","subcategory":"Others","feedback":"I would like to highlight an error that is found on a display at Bishan library Junior section One of the letters has to be removed from the word ???????. It should be ????? ."},{"category":"Collection-Print","subcategory":"Review of titles","feedback":"My <DATE_TIME> daughter recently borrowed <PERSON> book entitledRobodog from the children's section of one the national libraries. The book features a female police chief with a wife, and even a scene where they express affection for each other. I understand that shows with LGBTQ themes are rated NC-16 in <LOCATION>. Surely a book with such themes should be moved to the Young Adult or Adult section. I have attached a photo from the book below for your kind reference. I hope action can be taken to move the book to a section for more mature readers."},{"category":"Collection-Print","subcategory":"Shelving","feedback":"I have been to <LOCATION> Regional Library a few times. It has been frustrating looking for books referencing the book shelf location from the NLB app. See attached for an example, the book I want to borrow is supposed to be found at Early Literacy 4-6 Junior Picture. It took a long time for me to find it because the actual shelf it was on was labelled ???????4?8??. Out of 10 books I shortlisted on my NLB app, I could only find 1 or 2 <DATE_TIME> in Punggol Regional Library. Please standardize the signages to the NLB app records. The staff I approached also tried their best but I could see they were also confused a lot of times about which shelf the app was referring to. I also found out that because some shelves were full, 2 of those books marked available in the app, were actually not put on the shelves but in storage. In particular the Hanyu Pinyin section. Please look into the Hanyu Pinyin section. Thanks. Aside from my feedback, please keep up with the good work you are doing for the literacy of our nation."},{"category":"Collection-Print","subcategory":"Variety","feedback":"Thanks for your reply. Unfortunately NUS or NTU do not grant public access to their libraries, much less to borrow their books. The books I mentioned (and which are in my recommendations list in my NLB account) are available in the Munich public library, which is where I'm currently borrowing them from. <LOCATION> is considerably smaller than <LOCATION>, with a much smaller population. As mentioned, these books are not specialised in the sense of being hard to understand but rather in the sense of being of a certain genre or topic. I do hope NLB will think as highly of <LOCATION>'s population as <LOCATION> does its own and procure these books in future."},{"category":"Customer Service","subcategory":"Others","feedback":"This staff uses astral travelling. And uses the unorthodox rape on me. And witchcraft. Please dismiss him. Guy in pink shirt at <DATE_TIME>. At level 2. Very tall man."},{"category":"Customer Service","subcategory":"Staff","feedback":"The staff in Bedok Library is very helpful"},{"category":"Customer Service","subcategory":"Vendor","feedback":"I am very pleased being served by Mr <PERSON> during my visit. He was very helpfull, patience, polite and friendly in helping me out with the computer application. thank you so much and really appreciate?? Thank you."},{"category":"Environment","subcategory":"Cleanliness","feedback":"here are a lot of ants at the lee kong chian referance library level 7"},{"category":"Environment","subcategory":"Furniture (condition)","feedback":"We received feedback via the OneService app about a torn sofa on level 2"},{"category":"Environment","subcategory":"Noise","feedback":"I have been to many libraries such as woodlands, sengkang, bugis and serangoon and none like Punggol library. It is the only library that allowed kids to scream <DATE_TIME> and no librarian is present to check on them. Please ensure that the library is <SG_ADDRESS_STREET> people to study for exams and not for parents to bring kids to pass time. If these parents can't cannot control their kids, please ask them to leave. Thank you."},{"category":"Environment","subcategory":"Others","feedback":"Bishan library lifts are in bad shape. other library lifts move up and down smoothly but this library, the lifts are not functioning well, super slow and have to press the buttons many times. time to upgrade the buttons."},{"category":"Environment","subcategory":"Seating Availability","feedback":"Hi Sir\/madam, Pls set up and add more free seating tables at one Punggol library as the capacity is nearly full 100% almost everyday. Thanks."},{"category":"Environment","subcategory":"Signage","feedback":"Hi, I signed up for the event at Central Library <DATE_TIME> on <LOCATION>. The display of the number of available parking lots at <SG_ADDRESS_STREET> is faulty. It showed that there were 24 available lots when I entered, but there were none. I left after circling and waiting for <DATE_TIME>."},{"category":"Environment","subcategory":"Toilets","feedback":"Ang mo kio library 2nd floor male toilet, the air stink. Very bad smell"},{"category":"Policies & Procedures","subcategory":"Circulation","feedback":"Why NLB has to lock me up from borrowing (E-book) when I have an outstanding fee which is not due for payment? Don't you think this is unfriendly and high-handed to punish reader for NO-OBVIOUS reason? It is unacceptable as public serving organization."},{"category":"Policies & Procedures","subcategory":"Claim Return","feedback":"I just received a call (<DATE_TIME> 2pm) <SG_ADDRESS_STREET> library regarding a book (Greg the sausage roll) I borrowed and returned on <DATE_TIME>. I was accused of tearing the pages within; and I'm highly offended by the call. It has been a good <DATE_TIME> since I returned the book, and I am supposed to be responsible for a book which I returned <DATE_TIME>?! The staff then told me that the book was in an internal shelf. What does that mean to me? Your staff has zero chance of tearing a book, while it's definitely my family who did it? And honestly, how would I know where did the book circulate in the library after I had returned it. My only daughter is <DATE_TIME>. Way past the age of book tearing. In fact, the books she had since she was a baby and regularly read are still in very good condition - way better than those in the library. So it's highly insulting to insinuate that we caused the tear; especially since it has been so long since we returned the book. Please investigate. I expect a reply."},{"category":"Policies & Procedures","subcategory":"Library Etiquette-others","feedback":"Could staff please remove parents with kids from adults sections, I am currently at level3 of Jurong West public library and there is a kid and his mother constantly talking and the mother is constantly trying to get him to talk softer I think but it's kind of irritating and disruptive, libraries are supposed to be quiet right? There is a kids section on level2 also don't know why they have to be talking on level 3. It is just not considerate to bring kids who can't control their volume to quiet areas."},{"category":"Policies & Procedures","subcategory":"Library Etiquette - Studying","feedback":"refer to the LKC Library @ <SG_ADDRESS_STREET> (Levels 7-11). As <DATE_TIME> is the start of the School Holidays, many O A levels students are at the LKC library. By <DATE_TIME>, most of the seats were taken and reserved. These students genuinely want <SG_ADDRESS_STREET> study. However, some reserve seats for their friends <SG_ADDRESS_STREET> bags thus reducing the optimal seating capacity. May I request for NLB to initiate patrolling to allow maximum Number of Students. Both these traits in our society rear its ugly head even in the library. I am sure LKC Library knows very well that these students are here from third term school holidays until their major exams. Of course there are some Sec 3 and JC 1 students too. I hope LKC would improve the current situation."},{"category":"Policies & Procedures","subcategory":"Library fines","feedback":"Many thanks to you and the NLB team for understanding and accepting my request for a fine waiver. However, I must clarify that I have returned all the books to the library and do not have any of the items listed below in my possession. As I previously explained to the staff of Punggol library, there were a few occasions when the automated return system did not capture the books I returned. Unfortunately, as we did not anticipate this issue, we did not record or photograph the incidents where the books were placed in the return slot but were not reflected on the screen. I kindly ask for your trust and understanding that we are not holding on to any of the library books listed below."},{"category":"Policies & Procedures","subcategory":"Membership-Basic","feedback":"I hope that you will reconsider allowing EP\/DP holders to get a library card for the same price as PR. We also pay taxes! I am on a teacher's salary and would really appreciate being able to get a library card, at least for my kids. They go to an international school, but not because I can afford it - only because I teach there and tuition is partially waived (leading to more taxes). I understand thatit <SG_ADDRESS_STREET> generate funds for the library, but is very difficult on those of us that don't make quite as much as some of the other expats. Thank you for your consideration,"},{"category":"Policies & Procedures","subcategory":"Opening Hours","feedback":"Hi,dear <PERSON>,can we have a library open at public holiday,very thanks"},{"category":"Policies & Procedures","subcategory":"Others","feedback":"I would like to know why the entrance to the Bedok Library on the second floor is closed and we can only enter and exit from the 3rd floor? Those who want to go to the second floor now needs to enter from 3rd floor and also need to climb up to 3rd floor to exit. It totally doesnt make any sense and created a lot of inconvenience particularly for senior citizens. I hope NLB can explain this decision."},{"category":"Policies & Procedures","subcategory":"Reservation fee & policy","feedback":"I do think NLB should do away with reservation fees as well as cost of transferring books. The amount adds up"},{"category":"Programmes","subcategory":"Event Publicity - GoLibrary","feedback":"Hi! I would like to feedback that more introductory sessions for MakeIT should be conducted as these sessions are always sold out so quickly! I've been trying to apply for the sewing and 3D printing introductory courses but have always been unsuccessful! They are amazing initiatives and more sessions should be held! Thank you!"},{"category":"Programmes","subcategory":"Event Publicity - Others","feedback":"Hi, we went to the library at lot 1 choa chu kang to collect the goodie bag, as stated below but was informed by the officer that there is no more goodie bag. could you clarify pls. thanks."},{"category":"Programmes","subcategory":"Exhibition","feedback":"Interesting exhibit items and gallery"},{"category":"Programmes","subcategory":"Loan Promotion","feedback":"Book bugs enamel pins should be restricted to 1 redemption per library account to ensure all have a chance to collect the pins."},{"category":"Programmes","subcategory":"Others","feedback":"his is the reply received. Unsure if they will be replying another time. But the link is from NLB so unsure why your earlier reply mention Panopto not NLB vendor."},{"category":"Programmes","subcategory":"Presentation","feedback":"Facilitated Read for Books session on <DATE_TIME>, <DATE_TIME>. The theme was on Light-hearted murder mysteries and she shared book recommendations and cultivated exchange of book recommendations and community between programme participants. Feedback received: Like the recommendations by the librarians!"},{"category":"Programmes","subcategory":"Registration","feedback":"Why do we have to provide our NLB login when we sign up for events? Some of us use our NRIC as NLB login and this info is collected by eventbrite. Why does NLB allow an external non-gov party to collect all NLB logins? A hacker just need to anyhow key in random passwords to hack into NLB accounts with all the NLB logins collected to retrieve personal info"},{"category":"Programmes","subcategory":"Speaker","feedback":"went to <PERSON>. the <NRP> lady ( leader) has serious attitude problems. she is rude and arrogant. even scolded a performer participant in front of everybody for mispronouncing her name. that lady was visibly upset. later, lady told us she scolded her back. the leader bad attitude causes dis-harmony. nothing wrong with mispronouncing a name. I couldn't even remember <PERSON> and he is our President. 3 of us were first timers attending to see what was <PERSON>. we walked out as we did not want to see such behaviour."},{"category":"Programmes","subcategory":"Variety","feedback":"Have a mindfulness event once a month"},{"category":"Services & Facilities","subcategory":"Book Borrowing Station","feedback":"I have repeatedly encountered the same issues at your branches when attempting to borrow books at the borrowing machines. This has been happening for some time now, in particular <DATE_TIME> and <DATE_TIME>. It would appear that there is a software problem: l am not <SG_ADDRESS_STREET> than two books on the specified borrowing table for scanning at any one time, when the screen apparently invites the <SG_ADDRESS_STREET> to six books for borrowing during any one transaction. I have sought NLB staff assistance each time I encounter this problem. I am disappointed that each time, I get the same response from your staff : that there is some problem with the system, so why don't I use the NLB APP instead. While I appreciate that there is an alternative to borrowing on-site, I strongly feel that the existing borrowing feature at the machines SHOULD correctly serve its purpose. Namely, the borrowing system at the machines MUST function at all times; staff and borrowers must not have to improvise to get around the problem, especially since this problem has been there for a very long time."},{"category":"Services & Facilities","subcategory":"Bookdrop","feedback":"Hi! It's a great idea that we're able to borrow books at westmall since it's undergoing renovation. May i suggest to have an area that we can return the borrow NLB books too. Thanks!"},{"category":"Services & Facilities","subcategory":"Catalogue","feedback":"I am therefore writing to you in the hope that the NLB could respond on the following: 1. confirm whether the current online search engine is unable to locate travel guide books; 2a. if it can't, please enhance the search engine so that it is able to do so ; 2b., if it can, please explain HOW I can look for specific travel guide books using your online search; 3. train your officers to read, understand and address queries in the spirit of public service rather than reflexively redirect and deflect queries they receive. 4. train your branch library staff in the use of NLB's online search functions don't you think that your frontline staff should minimally be familiar with the use of your primary public interface?"},{"category":"Services & Facilities","subcategory":"E-Kiosk","feedback":"NLB should reduce the electronic resources in kid area. Based on the study, the kids should have minimum screen time. But I found that the NLB facility doesnt allign with this recommensation. Whenever I am bringing my kid to the library@vivocity, there are always full with kids surrounding the computer and playing game."},{"category":"Services & Facilities","subcategory":"E-Resources","feedback":"in a fast pace world, NLB needs to subscribe to blinkist so that we can take in highlights of each new book in a faster manner. this should at least be offered to citizens."},{"category":"Services & Facilities","subcategory":"Facilities Booking Services","feedback":"Suggest people should only be allowed to book seats when physically present at the library. Many book in advance and don't turn up. It deprives others who are present but can't book as seats are already booked."},{"category":"Services & Facilities","subcategory":"Microfilm services","feedback":"I went to the Reference section of NLB and wanted to take print outs from some micro films. I learn that the printer is not available and all we can <SG_ADDRESS_STREET> files. Can you please help making a printer available ? thanks. Also, will this be a printer that prints photograph like printouts or just photocopier type? asking since the prints I am taking are photographs mainly."},{"category":"Services & Facilities","subcategory":"Mobile App","feedback":"The recent NLB app update is not compatible for Android 9 which means I will not be able to use your app in future. I will need to access my account, loan records etc through your website instead. Is it possible to make you app more compatible and less exclusive so users with older phones are not excluded."},{"category":"Services & Facilities","subcategory":"Multimedia Stations","feedback":"The National Library does not have d WORD software for users. I think it is something so basic n d Library should have it. Retirees like me once in a while need to type something on Word but d Library do not have it. It is costly for retirees to buy but for d government it can benefit student too. Tq"},{"category":"Services & Facilities","subcategory":"NLB Website","feedback":"We received the following feedback from an anonymous patron aboutthe info at our website (the linkbelow) is very old and not updated for <DATE_TIME> [<URL>"},{"category":"Services & Facilities","subcategory":"Online renewal","feedback":"Thank you for your response. However, as highlighted earlier, I believe my feedback has not been addressed. If the feedback is understood, it should be clear it isn't conflicting with equitable availability of resources. Thus it does not explain why the borrower was not afforded the opportunity to extend the borrowing period, resulting in immediate overdue charges. The borrower is already allowed renewal and there is no reservation in question. The replies seems to constantly brushing aside the feedback without properly understanding them. There are flaws in the current processes, that seems contradictory to the principle of providing library services to patrons. I hope NLB can take a closer look at the feedback provided and address them more specifically."},{"category":"Services & Facilities","subcategory":"Others","feedback":"I'd like to suggest adding multi-faith prayer facilities or quiet rooms in your libraries for prayers and\/or private contemplation."},{"category":"Services & Facilities","subcategory":"Photocopying services","feedback":"I feedback library should hv colour printing and scanners."},{"category":"Services & Facilities","subcategory":"Powerpoint outlets","feedback":"The electrical socket at seat S52 of Jurong West Public Library is faulty. Further, I saw elderly trying to use S56's socket but left after plugging in to use another table, it is likely to be faulty as well. Hope NLB may conduct maintenance on the electrical sockets."},{"category":"Services & Facilities","subcategory":"Reference Services","feedback":"What is the official researchers association for this? If there is such an association where NLB refers to their work."},{"category":"Services & Facilities","subcategory":"Wireless Internet services","feedback":"Hi, I am at at the Level 3 cafe in the NLB Building, and realised that there is no access to WirelessSG. No other WiFi here either. I would like to suggest installing WirelessSG here please, as this is something that most patrons have come to expect in all NLB areas?"}]