{
    "feedback_data": [
      {
        "category": "Digital Collection",
        "subcategory": "Availability",
        "feedback": "Dear Library Team, I've been trying to access the e-book 'The Midnight Library' for weeks now, but it's always unavailable. Could you please consider purchasing more digital licenses for popular titles? It's frustrating to wait so long. Thank you for your consideration. Best regards, Emily Chen"
      },
      {
        "category": "Digital Collection",
        "subcategory": "Availability",
        "feedback": "Hello, I'm writing to express my concern about the limited availability of audiobooks in your digital collection. It seems that all the bestsellers are constantly on hold with long waiting lists. Is there a way to increase the number of copies for high-demand titles? It would greatly improve the user experience. Thanks, Michael Wong"
      },
      {
        "category": "Digital Collection",
        "subcategory": "Variety",
        "feedback": "Hello Library Management, I'm a big fan of your digital collection, but I've noticed a lack of diversity in the non-fiction section, particularly in science and technology topics. It would be great if you could expand the variety in these areas. Perhaps consider adding more recent publications on artificial intelligence and machine learning? Thank you for your time, Dr. Jasmine Teo"
      },
      {
        "category": "Digital Collection",
        "subcategory": "Variety",
        "feedback": "Dear Sir/Madam, I'm writing to suggest an improvement to your digital magazine collection. While you have a good selection of general interest magazines, there seems to be a limited variety of specialized or niche publications. It would be wonderful if you could add more magazines related to hobbies like gardening, woodworking, or photography. This would greatly enhance the value of the digital collection for many patrons. Best wishes, Robert Ng"
      },
      {
        "category": "Physical Collection",
        "subcategory": "Availability",
        "feedback": "Dear Library Management, I've been trying to borrow 'The Midnight Library' for over a month now, but it's always checked out. Could you please consider purchasing additional copies of popular books to reduce wait times? It's frustrating to see such long hold queues. Thank you for your consideration. Best regards, Sarah Lim"
      },
      {
        "category": "Physical Collection",
        "subcategory": "Availability",
        "feedback": "Hello, I'm writing to express my concern about the limited availability of textbooks in your collection. As a student, it's challenging to find the required course materials, especially during exam periods. Would it be possible to increase the number of copies for commonly used textbooks? This would greatly help students like me. Thanks in advance, John Tan"
      },
      {
        "category": "Physical Collection",
        "subcategory": "Review of titles",
        "feedback": "Hello Library Team, I recently borrowed 'The Silent Patient' and found it to be an excellent psychological thriller. I highly recommend adding more titles by Alex Michaelides to your collection. It would be great to see more contemporary mystery novels like this one. Best regards, Michelle Lee"
      },
      {
        "category": "Physical Collection",
        "subcategory": "Review of titles",
        "feedback": "Dear Sir/Madam, I wanted to provide feedback on the book 'Atomic Habits' by James Clear. It's an insightful read on building good habits and breaking bad ones. I think it would be valuable to have more copies of this book available, as well as similar self-improvement titles. They seem to be in high demand. Thanks for your consideration, David Ng"
      },
      {
        "category": "Physical Collection",
        "subcategory": "Shelving",
        "feedback": "To the Library Staff, I've noticed that books in the History section are often misplaced or difficult to locate. It seems the shelving in this area isn't being maintained as regularly as it should be. Could you please ensure more frequent reshelving in this section? It would make finding specific titles much easier. Thank you, Professor Lim Mei Ling"
      },
      {
        "category": "Physical Collection",
        "subcategory": "Shelving",
        "feedback": "Hello, I'm writing to bring attention to the disorganized state of the Children's section. As a parent, I find it challenging to help my kids find books because they're often not in their correct places. Could this area be tidied more frequently? It would greatly improve our library experience. Best wishes, Mrs. Siti Aminah"
      },
      {
        "category": "Physical Collection",
        "subcategory": "Vandalism",
        "feedback": "Dear Library Management, I'm writing to report that I found a book with several pages torn out in the Fiction section (call number F LEE). It's disheartening to see such disrespect for public resources. Could you implement stricter measures to prevent book vandalism? Sincerely, Robert Tan"
      },
      {
        "category": "Physical Collection",
        "subcategory": "Vandalism",
        "feedback": "Hello, I wanted to inform you that I noticed some inappropriate drawings in one of the graphic novels in the Young Adult section. It appears someone has defaced several pages with crude sketches. Could you please remove this book for review and consider ways to discourage such behavior? Thank you for your attention to this matter. Regards, Concerned Parent"
      },
      {
        "category": "Physical Collection",
        "subcategory": "Variety",
        "feedback": "To whom it may concern, I've noticed that your collection of books on artificial intelligence and machine learning is quite limited. Given the growing importance of these fields, could you consider expanding this section? It would be incredibly helpful for students and professionals in the tech industry. Thanks in advance, Dr. Tan Wei Ling"
      },
      {
        "category": "Physical Collection",
        "subcategory": "Variety",
        "feedback": "Dear Librarian, As an avid cook, I'd love to see more variety in your cookbook collection. While you have a good selection of general cookbooks, it would be great to see more titles focusing on specific cuisines (especially Asian cuisines) or dietary requirements (like vegan or gluten-free). This would cater to our diverse community's culinary interests. Best wishes, Chef Kumar"
      },
  {
        "category": "Customer Service",
        "subcategory": "Staff",
        "feedback": "Dear Library Management, I wanted to commend one of your staff members, Ms. Tan, for her exceptional service yesterday. She went above and beyond to help me locate a rare book I needed for my research. Her knowledge and patience were truly appreciated. It's staff like her that make our library such a valuable resource. Sincerely, Professor Lee Kuan Yew"
      },
      {
        "category": "Customer Service",
        "subcategory": "Staff",
        "feedback": "Hello, I'm writing to express my disappointment with the service I received from one of your librarians on Tuesday afternoon. When I asked for help finding a book on Singapore's history, the staff member seemed disinterested and barely looked up from their computer. This is not the level of service I've come to expect from our library. I hope this feedback can be used constructively to improve customer service. Regards, Mrs. Siti Aminah"
      },
  {
        "category": "Customer Service",
        "subcategory": "Vendor",
        "feedback": "To the Library Administration, I wanted to commend the cleaning service vendor you've contracted. The library has never looked cleaner or more organized. It's a pleasure to spend time in such a well-maintained space. Please pass on my compliments to the cleaning staff. Sincerely, Neat Freak Nancy"
      },
      {
        "category": "Customer Service",
        "subcategory": "Vendor",
        "feedback": "Hello, I'm writing about the photocopying services provided by the current vendor. The machines are often out of order or produce poor quality copies. Additionally, the cost per page seems higher than at other libraries or copy shops. Could you please review this service and consider alternatives? It would be much appreciated. Thanks, Researcher Raj"
      },
  {
        "category": "Environment",
        "subcategory": "Cleanliness",
        "feedback": "Dear Library Management, I wanted to commend the cleanliness of the library. During my visit yesterday, I noticed how spotless the floors were and how tidy the shelves looked. It's a pleasure to study in such a well-maintained environment. Keep up the excellent work! Best regards, Sarah Tan"
      },
      {
        "category": "Environment",
        "subcategory": "Cleanliness",
        "feedback": "Hello, I'm writing to express my concern about the cleanliness of the study tables. I've noticed that they're often sticky and have food stains. Could you please ensure more frequent cleaning of these areas? It would greatly improve the studying experience for all patrons. Thank you, John Lee"
      },
      {
        "category": "Environment",
        "subcategory": "Furniture (condition)",
        "feedback": "To whom it may concern, I wanted to bring to your attention the condition of the chairs in the reading area. Many of them are wobbly and uncomfortable, making it difficult to sit for extended periods. Could you please consider replacing or repairing these chairs? It would greatly enhance the comfort of library users. Sincerely, Emily Wong"
      },
      {
        "category": "Environment",
        "subcategory": "Furniture (condition)",
        "feedback": "Dear Sir/Madam, I'm writing to compliment the new study carrels installed last month. They're spacious, well-lit, and provide excellent privacy for focused work. This upgrade has significantly improved my library experience. Thank you for investing in quality furniture. Best wishes, Michael Lim"
      },
      {
        "category": "Environment",
        "subcategory": "Noise",
        "feedback": "Hello Library Staff, I'm a regular patron and I've noticed an increase in noise levels, especially in the quiet study areas. Could you please consider implementing stricter noise policies or creating more soundproof spaces? It's becoming challenging to concentrate. Thank you for your attention to this matter. Regards, Frustrated Student"
      },
      {
        "category": "Environment",
        "subcategory": "Noise",
        "feedback": "Dear Library Management, I wanted to express my appreciation for the new 'silent zone' implemented on the third floor. It's been a great addition for those of us who need absolute quiet for studying. The staff has done an excellent job of maintaining the silence. Well done! Best, Grateful Researcher"
      },
      {
        "category": "Environment",
        "subcategory": "Others",
        "feedback": "To the Library Team, I've noticed that the temperature in the library is often too cold, especially in the afternoons. Many patrons, including myself, find it uncomfortable and have to bring extra layers. Could you please look into adjusting the air conditioning? Thank you for your consideration. Sincerely, Chilly Charlie"
      },
      {
        "category": "Environment",
        "subcategory": "Others",
        "feedback": "Hello, I wanted to suggest improving the lighting in the reading areas. The current lighting is quite dim, which can cause eye strain during long reading sessions. Brighter or adjustable lighting options would be greatly appreciated. Thanks for your attention to this matter. Best regards, Bookworm Betty"
      },
      {
        "category": "Environment",
        "subcategory": "Seating Availability",
        "feedback": "Dear Library Administration, I'm writing to express my frustration with the lack of available seating during peak hours, especially in the afternoons. It's often impossible to find a place to study. Could you consider adding more seating or implementing a reservation system? Thank you, Disappointed Daniel"
      },
      {
        "category": "Environment",
        "subcategory": "Seating Availability",
        "feedback": "Hello, I wanted to commend the library for the recent addition of more study tables and chairs. It has significantly improved seating availability, even during busy periods. This change has made the library a much more accessible and enjoyable place to work. Thank you! Best wishes, Happy Hannah"
      },
      {
        "category": "Environment",
        "subcategory": "Signage",
        "feedback": "To whom it may concern, I find the current signage in the library confusing and inadequate. It's often difficult to locate specific sections or services. Could you please consider updating and expanding the signage throughout the library? It would greatly help patrons navigate more easily. Thank you, Lost Larry"
      },
      {
        "category": "Environment",
        "subcategory": "Signage",
        "feedback": "Dear Library Team, I wanted to express my appreciation for the new digital signage installed at the entrance. It's very helpful in highlighting events, new arrivals, and library updates. The clear, dynamic displays have significantly improved my awareness of library offerings. Well done! Sincerely, Informed Irene"
      },
      {
        "category": "Environment",
        "subcategory": "Toilets",
        "feedback": "Hello Library Management, I'm writing to report an issue with the cleanliness of the toilets on the second floor. They're often out of soap and paper towels, and the floors are frequently wet. Could you please ensure more regular maintenance of these facilities? Thank you for your attention to this matter. Regards, Concerned Patron"
      },
      {
        "category": "Environment",
        "subcategory": "Toilets",
        "feedback": "Dear Sir/Madam, I wanted to commend the recent renovation of the ground floor toilets. The new facilities are clean, modern, and well-maintained. It's a significant improvement and adds to the overall positive experience of visiting the library. Thank you for this upgrade. Best wishes, Satisfied Sam"
      },
     {
        "category": "Policies & Procedures",
        "subcategory": "Cashless payment",
        "feedback": "Dear Library Management, I appreciate the recent move to cashless payments for fines and fees. It's much more convenient and safer. However, I noticed that the system was down last week, causing delays. Could you ensure there's a backup payment method available in such cases? Thank you, Sarah Tan"
      },
      {
        "category": "Policies & Procedures",
        "subcategory": "Cashless payment",
        "feedback": "Hello, I'm writing to suggest adding more payment options to your cashless system. Currently, it only accepts credit cards, but it would be great if you could include options like PayNow or NETS. This would make it easier for those who don't use credit cards. Best regards, John Lee"
      },
      {
        "category": "Policies & Procedures",
        "subcategory": "Circulation",
        "feedback": "To whom it may concern, I find the current loan period of 21 days too short, especially for non-fiction books. Would it be possible to extend this to 28 days or allow for online renewals? This would greatly help those of us doing in-depth research. Sincerely, Professor Lim"
      },
      {
        "category": "Policies & Procedures",
        "subcategory": "Circulation",
        "feedback": "Dear Library Staff, I wanted to commend your efficient circulation system. The self-checkout kiosks are user-friendly and rarely have issues. It's made borrowing books a breeze. Keep up the good work! Best wishes, Happy Patron"
      },
      {
        "category": "Policies & Procedures",
        "subcategory": "Claim return",
        "feedback": "Hello, I'm writing about a book I returned last week that's still showing as checked out on my account. I've tried to resolve this at the counter, but the staff couldn't help. Could you please look into improving the claim return process? It's quite stressful. Thank you, Worried William"
      },
      {
        "category": "Policies & Procedures",
        "subcategory": "Claim return",
        "feedback": "Dear Sir/Madam, I wanted to express my gratitude for your efficient handling of my recent claim return issue. The staff was understanding and resolved the problem quickly. It's reassuring to know that such processes are in place. Best regards, Relieved Rachel"
      },
      {
        "category": "Policies & Procedures",
        "subcategory": "Donation",
        "feedback": "To the Library Team, I recently tried to donate some books but was turned away because you weren't accepting donations at the time. It would be helpful if you could post your donation policies and schedules on your website. This would save patrons time and effort. Thanks, Generous Giver"
      },
      {
        "category": "Policies & Procedures",
        "subcategory": "Donation",
        "feedback": "Hello Library Management, I appreciate your book donation program. However, I noticed that the drop-off point is often full. Could you consider increasing the frequency of collection or providing a larger donation box? It would encourage more people to donate. Sincerely, Book Lover"
      },
      {
        "category": "Policies & Procedures",
        "subcategory": "Fine mailers",
        "feedback": "Dear Library Administration, I recently received a fine mailer for an overdue book, but the notification came after the due date. It would be more helpful if these reminders were sent a few days before the due date. This could help patrons avoid fines altogether. Thank you for considering this suggestion. Best, Punctual Paula"
      },
      {
        "category": "Policies & Procedures",
        "subcategory": "Fine mailers",
        "feedback": "Hello, I wanted to commend your new email notification system for fines. It's clear, timely, and provides easy instructions for payment. This has greatly improved my library experience. Well done! Regards, Satisfied Sam"
      },
      {
        "category": "Policies & Procedures",
        "subcategory": "Library Etiquette-others",
        "feedback": "To whom it may concern, I've noticed an increase in patrons eating in the library, despite the no-food policy. Could you please consider putting up more visible signs about this rule and perhaps increase staff monitoring? The food odors and potential for book damage are concerning. Thank you, Concerned Reader"
      },
      {
        "category": "Policies & Procedures",
        "subcategory": "Library Etiquette-others",
        "feedback": "Dear Library Staff, I wanted to express my appreciation for your handling of a recent situation where a patron was talking loudly on their phone. The staff member politely reminded them of the quiet policy, which greatly improved the environment for everyone. Keep up the good work! Best, Quiet Quentin"
      },
      {
        "category": "Policies & Procedures",
        "subcategory": "Library Etiquette - Studying",
        "feedback": "Hello Library Management, I'm a student who frequently uses the library for studying. Lately, I've noticed groups of students being quite noisy in the individual study areas. Could you please consider implementing stricter rules or creating more designated group study spaces? Thank you, Focused Fiona"
      },
      {
        "category": "Policies & Procedures",
        "subcategory": "Library Etiquette - Studying",
        "feedback": "Dear Sir/Madam, I wanted to commend the new 'quiet floor' policy you've implemented. It's made a significant difference in providing a peaceful environment for serious study. The clear signage and staff enforcement have been excellent. Well done! Sincerely, Grateful Grad Student"
      },
      {
        "category": "Policies & Procedures",
        "subcategory": "Library fines",
        "feedback": "To the Library Team, I understand the need for fines, but I find the current rate quite high. For students like me, it can be a significant burden. Would you consider implementing a tiered system or offering alternatives like community service? Thank you for your consideration. Best, Struggling Student"
      },
      {
        "category": "Policies & Procedures",
        "subcategory": "Library fines",
        "feedback": "Hello, I appreciate the recent change in fine policy where fines are waived if books are returned within a grace period. It's a fair system that encourages timely returns without being punitive. Thank you for this patron-friendly approach. Regards, Appreciative Alex"
      },
      {
        "category": "Policies & Procedures",
        "subcategory": "Membership-Basic",
        "feedback": "Dear Library Administration, I recently tried to sign up for a library membership online but found the process confusing. Could you please simplify the online registration form and provide clearer instructions? This would make it easier for new patrons to join. Thank you, Potential Patron"
      },
      {
        "category": "Policies & Procedures",
        "subcategory": "Membership-Basic",
        "feedback": "Hello, I wanted to express my satisfaction with the new digital library card option. Being able to use my smartphone as my library card is incredibly convenient. Great job embracing technology! Best wishes, Tech-Savvy Tessa"
      },
      {
        "category": "Policies & Procedures",
        "subcategory": "Opening Hours",
        "feedback": "To whom it may concern, I'm writing to request an extension of library hours, particularly on weekends. As a working professional, I find it challenging to visit the library during current hours. Even an extra hour on Saturday evenings would be incredibly helpful. Thank you for considering this suggestion. Sincerely, Weekend Warrior"
      },
      {
        "category": "Policies & Procedures",
        "subcategory": "Opening Hours",
        "feedback": "Dear Library Team, I wanted to commend your decision to open the library an hour earlier on weekdays. This has been a great help for early birds like me who like to study before work. Thank you for being responsive to community needs. Best regards, Morning Person Mary"
      },
      {
        "category": "Policies & Procedures",
        "subcategory": "Others",
        "feedback": "Hello Library Management, I noticed that the library doesn't have a clear policy on unattended children. Last week, I saw a very young child left alone for hours. Could you please consider implementing and publicizing a policy to ensure children's safety? Thank you, Concerned Citizen"
      },
      {
        "category": "Policies & Procedures",
        "subcategory": "Others",
        "feedback": "Dear Sir/Madam, I wanted to suggest implementing a 'Quiet Room' policy where patrons can make short, essential phone calls without disturbing others. Many libraries I've visited have such spaces, and they're very useful. Thank you for considering this idea. Best, Practical Paul"
      },
      {
        "category": "Policies & Procedures",
        "subcategory": "Reservation fee & policy",
        "feedback": "To the Library Administration, I find the current reservation fee for books quite high, especially for students. Would it be possible to introduce a lower fee for students or a system where the fee is refunded upon pickup? This would make reservations more accessible. Thank you, Budget-conscious Bella"
      },
      {
        "category": "Policies & Procedures",
        "subcategory": "Reservation fee & policy",
        "feedback": "Hello, I wanted to express my appreciation for the new online reservation system. Being able to reserve books from home and receive email notifications when they're ready for pickup has been incredibly convenient. Well done on this improvement! Regards, Efficient Eddie"
      },
  {
        "category": "Programmes",
        "subcategory": "Event Publicity - GoLibrary",
        "feedback": "Dear Library Team, I recently discovered the GoLibrary app and I'm impressed with how it showcases upcoming events. However, I noticed that some events aren't updated in real-time. It would be great if you could ensure all events are promptly reflected in the app. This would help patrons like me plan better. Thank you, Tech-Savvy Tina"
      },
      {
        "category": "Programmes",
        "subcategory": "Event Publicity - GoLibrary",
        "feedback": "Hello, I wanted to commend the library for the excellent use of push notifications in the GoLibrary app for event reminders. It's been incredibly helpful in ensuring I don't miss out on interesting programmes. Keep up the good work! Best regards, Appreciative Andy"
      },
      {
        "category": "Programmes",
        "subcategory": "Event Publicity - others",
        "feedback": "To whom it may concern, I've noticed that your event posters around the library are often outdated. It would be helpful if these could be updated more regularly to reflect current and upcoming events. This would ensure patrons don't miss out on interesting programmes. Thank you for your consideration. Sincerely, Observant Olivia"
      },
      {
        "category": "Programmes",
        "subcategory": "Event Publicity - others",
        "feedback": "Dear Library Management, I wanted to suggest expanding your event publicity to social media platforms like Instagram and Twitter. Many young patrons like myself rely on these platforms for information. It could help increase participation in your excellent programmes. Best wishes, Social Media Sam"
      },
      {
        "category": "Programmes",
        "subcategory": "Exhibition",
        "feedback": "Hello Library Staff, I recently attended the 'Local Authors' exhibition and found it incredibly informative and well-curated. The interactive elements were particularly engaging. I would love to see more exhibitions like this in the future. Great job! Regards, Culture Enthusiast Charlie"
      },
      {
        "category": "Programmes",
        "subcategory": "Exhibition",
        "feedback": "Dear Sir/Madam, While I appreciate the effort put into the recent art exhibition, I found the space a bit cramped and poorly lit. It was difficult to fully appreciate the artworks. For future exhibitions, could you consider using a larger area with better lighting? Thank you for your attention to this feedback. Sincerely, Art Aficionado Alice"
      },
      {
        "category": "Programmes",
        "subcategory": "Loan promotion",
        "feedback": "To the Library Team, I wanted to express my appreciation for the recent 'Borrow 5, Get 1 Free' loan promotion. It encouraged me to explore genres I wouldn't typically read. These promotions are a great way to encourage reading. Well done! Best, Bookworm Barry"
      },
      {
        "category": "Programmes",
        "subcategory": "Loan promotion",
        "feedback": "Hello, I'm writing to suggest extending the duration of your loan promotions. The recent one only lasted a week, which wasn't enough time for many patrons to take advantage of it. Perhaps consider running them for at least two weeks? Thank you for considering this feedback. Regards, Promo Fan Penny"
      },
      {
        "category": "Programmes",
        "subcategory": "Others",
        "feedback": "Dear Library Administration, I recently participated in the 'Reading Buddies' programme and found it incredibly rewarding. However, I noticed there weren't many adult volunteers. Perhaps you could promote this programme more widely to attract more participants? It's such a valuable initiative. Best wishes, Volunteer Vicky"
      },
      {
        "category": "Programmes",
        "subcategory": "Others",
        "feedback": "To whom it may concern, I wanted to suggest implementing a book club programme at the library. It would be a great way for readers to connect and discuss literature. If you need help organizing, I'd be happy to volunteer. Thank you for considering this idea. Sincerely, Book Lover Ben"
      },
      {
        "category": "Programmes",
        "subcategory": "Presentation",
        "feedback": "Hello Library Team, I attended the recent presentation on digital literacy for seniors and found it extremely helpful. The presenter was knowledgeable and patient. Could you please organize more such sessions? They're invaluable for helping older patrons navigate the digital world. Thank you, Grateful Grandma"
      },
      {
        "category": "Programmes",
        "subcategory": "Presentation",
        "feedback": "Dear Sir/Madam, While I appreciate the effort put into the recent financial literacy presentation, I found the content too basic for the advertised 'intermediate' level. In the future, could you provide more detailed descriptions of the content level? This would help attendees choose appropriate sessions. Regards, Finance Professional Fred"
      },
      {
        "category": "Programmes",
        "subcategory": "Registration",
        "feedback": "To the Library Management, I tried to register for the upcoming writing workshop but found the online registration system confusing and slow. It would be great if you could simplify the process or provide clearer instructions. This would make it easier for patrons to participate in your excellent programmes. Thank you, Aspiring Author Amy"
      },
      {
        "category": "Programmes",
        "subcategory": "Registration",
        "feedback": "Hello, I wanted to commend your new queue number system for event registrations. It's much fairer than the previous first-come-first-served system and has made the process less stressful. Great improvement! Best regards, Appreciative Alex"
      },
      {
        "category": "Programmes",
        "subcategory": "Speaker",
        "feedback": "Dear Library Staff, I attended the talk by Dr. Lee on climate change last week and was thoroughly impressed. His expertise and engaging presentation style made complex topics accessible. Please continue to invite such high-caliber speakers. It greatly enhances the library's value to the community. Sincerely, Lifelong Learner Larry"
      },
      {
        "category": "Programmes",
        "subcategory": "Speaker",
        "feedback": "To whom it may concern, While I appreciate the effort to bring in diverse speakers, I found the recent talk on local history to be poorly researched and presented. In the future, could you ensure that speakers are properly vetted for their expertise? This would maintain the high quality we expect from library programmes. Thank you, History Buff Helen"
      },
      {
        "category": "Programmes",
        "subcategory": "Variety",
        "feedback": "Hello Library Team, I've noticed that most of your programmes cater to either children or seniors. As a young professional, I'd love to see more events targeted at my age group, perhaps on topics like career development or modern literature. This would help attract more diverse patrons. Thanks for considering this suggestion. Best, Millennial Mike"
      },
      {
        "category": "Programmes",
        "subcategory": "Variety",
        "feedback": "Dear Sir/Madam, I wanted to express my appreciation for the wide variety of programmes you've been offering lately. From coding classes for kids to gardening workshops for adults, there's something for everyone. This diverse range of activities truly makes the library a community hub. Keep up the excellent work! Regards, Enthusiastic Erica"
      },
      {
        "category": "Programmes",
        "subcategory": "Venue",
        "feedback": "To the Library Administration, I recently attended a poetry reading in the main hall and found the acoustics to be poor. It was difficult to hear the speakers clearly. Could you consider using a better sound system or choosing a more suitable venue for such events in the future? Thank you for your attention to this matter. Sincerely, Audiophile Adam"
      },
      {
        "category": "Programmes",
        "subcategory": "Venue",
        "feedback": "Hello, I wanted to commend the library for the recent renovation of the event space. The new layout and equipment have greatly improved the experience of attending programmes. The flexible seating arrangements are particularly useful. Well done on this upgrade! Best wishes, Comfortable Cathy"
      },
      {
        "category": "Services & Facilities",
        "subcategory": "Book Borrowing station",
        "feedback": "Dear Library Management, I recently used the new self-service book borrowing station and found it incredibly efficient. It significantly reduced my waiting time. However, I noticed that it doesn't accept cash for paying fines. Could you consider adding this feature for those who prefer cash transactions? Thank you, Efficient Emma"
      },
      {
        "category": "Services & Facilities",
        "subcategory": "Book Borrowing station",
        "feedback": "Hello, I'm writing to report an issue with the book borrowing station on the second floor. It often fails to detect the RFID tags in books, causing frustration for users. Could you please have it checked and repaired? This would greatly improve the borrowing experience. Best regards, Patient Paul"
      },
      {
        "category": "Services & Facilities",
        "subcategory": "Book drop",
        "feedback": "To whom it may concern, The book drop service is generally convenient, but I've noticed that during peak times, the bin gets full quickly. Could you consider increasing the frequency of collection or installing a larger capacity bin? This would prevent books from piling up outside. Sincerely, Concerned Chris"
      },
      {
        "category": "Services & Facilities",
        "subcategory": "Book drop",
        "feedback": "Dear Library Staff, I wanted to commend you on the new 24/7 book drop facility. It's been incredibly helpful for those of us with busy schedules. The automatic receipt system is also a great touch. Well done on this improvement! Best wishes, Appreciative Alex"
      },
      {
        "category": "Services & Facilities",
        "subcategory": "Catalogue",
        "feedback": "Hello Library Team, I find your online catalogue system quite user-friendly, but I've noticed that the search function sometimes yields irrelevant results. Could you look into improving the search algorithm? This would make finding specific books much easier. Thank you, Searcher Sam"
      },
      {
        "category": "Services & Facilities",
        "subcategory": "Catalogue",
        "feedback": "Dear Sir/Madam, I appreciate the recent addition of book cover images to the online catalogue. It's made browsing much more engaging. However, I've noticed that some newer books are missing from the system. Could you ensure the catalogue is updated more frequently? Regards, Bookworm Betty"
      },
      {
        "category": "Services & Facilities",
        "subcategory": "Resources",
        "feedback": "To the Library Administration, I'm impressed with the range of e-books and online resources available. However, I've had trouble accessing some databases from home. Could you provide clearer instructions on how to use these resources remotely? This would be incredibly helpful for research. Thank you, Student Steve"
      },
      {
        "category": "Services & Facilities",
        "subcategory": "Resources",
        "feedback": "Hello, I wanted to suggest expanding your foreign language resources, particularly for less commonly taught languages. As someone learning Korean, I've found the current selection limited. More diverse language resources would be greatly appreciated. Best, Language Learner Lucy"
      },
      {
        "category": "Services & Facilities",
        "subcategory": "Facilities Booking Services",
        "feedback": "Dear Library Management, I recently tried to book a study room using your online system and found it quite cumbersome. The interface is not intuitive, and it took several attempts to complete my booking. Could you consider redesigning the system for better user experience? Sincerely, Frustrated Fred"
      },
      {
        "category": "Services & Facilities",
        "subcategory": "Facilities Booking Services",
        "feedback": "To whom it may concern, I appreciate the recent update to your facilities booking service that allows for longer advance bookings. This has made it much easier to plan group study sessions. However, could you consider implementing a waitlist feature for popular time slots? Thanks, Planner Penny"
      },
      {
        "category": "Services & Facilities",
        "subcategory": "Microfilm Services",
        "feedback": "Hello Library Staff, I recently used the microfilm services for my research and found the equipment to be outdated and difficult to use. Would it be possible to upgrade to more modern, user-friendly machines? This would greatly enhance the research experience. Thank you, Historian Harry"
      },
      {
        "category": "Services & Facilities",
        "subcategory": "Microfilm Services",
        "feedback": "Dear Sir/Madam, I wanted to express my appreciation for the helpful staff at the microfilm services desk. Their guidance made navigating old newspapers much easier. However, I noticed that some films are in poor condition. Could you look into digitizing these to preserve the information? Best regards, Grateful Researcher"
      },
      {
        "category": "Services & Facilities",
        "subcategory": "Mobile App",
        "feedback": "To the Library Team, Your mobile app is generally useful, but I've noticed it often crashes when trying to renew books. Could you please look into this issue? A stable app would make managing my loans much more convenient. Thank you, App User Andy"
      },
      {
        "category": "Services & Facilities",
        "subcategory": "Mobile App",
        "feedback": "Hello, I wanted to commend you on the recent update to the mobile app. The new feature that allows us to scan books in the library and see reviews is fantastic. It's made my browsing experience much more informative. Keep up the great work! Sincerely, Tech-Savvy Tina"
      },
      {
        "category": "Services & Facilities",
        "subcategory": "Multimedia Stations",
        "feedback": "Dear Library Management, I frequently use the multimedia stations for video editing, but I've noticed that the software is quite outdated. Would it be possible to update to more recent versions? This would greatly enhance the usefulness of these stations. Thank you, Digital Creator Dan"
      },
      {
        "category": "Services & Facilities",
        "subcategory": "Multimedia Stations",
        "feedback": "To whom it may concern, The multimedia stations are a great resource, but they're often all occupied. Could you consider adding more stations or implementing a time limit during peak hours? This would allow more patrons to benefit from this service. Best wishes, Waiting Wendy"
      },
      {
        "category": "Services & Facilities",
        "subcategory": "myLibrary ID",
        "feedback": "Hello Library Team, I recently had trouble resetting my myLibrary ID password. The process was confusing and the reset link expired too quickly. Could you please simplify this process and extend the validity of reset links? It would make account management much easier. Regards, Forgetful Frank"
      },
      {
        "category": "Services & Facilities",
        "subcategory": "myLibrary ID",
        "feedback": "Dear Sir/Madam, I appreciate the recent addition of two-factor authentication for myLibrary ID. It's reassuring to have this extra layer of security. However, could you provide an option for backup codes in case we lose access to our phones? Thank you, Security-Conscious Sarah"
      },
      {
        "category": "Services & Facilities",
        "subcategory": "NAS Website",
        "feedback": "To the Library Administration, I find the National Archives of Singapore website difficult to navigate. The search function isn't very intuitive and it's hard to find specific collections. Could you consider redesigning the site for better user experience? This would make research much easier. Sincerely, Struggling Scholar"
      },
      {
        "category": "Services & Facilities",
        "subcategory": "NAS Website",
        "feedback": "Hello, I wanted to commend the recent addition of virtual tours to the NAS website. It's a great way to explore the archives from home. However, I've noticed some of the links are broken. Could you please check and update these? Thank you, Virtual Visitor Vicky"
      },
      {
        "category": "Services & Facilities",
        "subcategory": "NLB Website",
        "feedback": "Dear Library Staff, I appreciate the wealth of information on the NLB website, but I find the layout cluttered and overwhelming. Would it be possible to streamline the design and improve the search functionality? This would make it easier to find what we're looking for. Best regards, Overwhelmed Olivia"
      },
      {
        "category": "Services & Facilities",
        "subcategory": "NLB Website",
        "feedback": "To whom it may concern, The new 'Recommended Reads' feature on the NLB website is fantastic! It's helped me discover many great books. However, I've noticed that the recommendations don't update very often. Could you increase the frequency of updates? Thanks, Avid Reader Adam"
      },
      {
        "category": "Services & Facilities",
        "subcategory": "Online renewal",
        "feedback": "Hello Library Management, The online renewal system is generally convenient, but I've noticed that it sometimes lags in reflecting renewed items. This has caused confusion about due dates. Could you look into making the system update in real-time? Thank you, Punctual Paula"
      },
      {
        "category": "Services & Facilities",
        "subcategory": "Online renewal",
        "feedback": "Dear Sir/Madam, I wanted to suggest extending the online renewal limit from 2 to 3 times per item. As a busy professional, this would be incredibly helpful in managing my borrowings. Of course, this could be subject to no reservations on the item. Best wishes, Time-Strapped Tim"
      },
      {
        "category": "Services & Facilities",
        "subcategory": "Online reservation",
        "feedback": "To the Library Team, I find the online reservation system very useful, but I've noticed that the estimated wait times are often inaccurate. Could you improve the algorithm for calculating these estimates? It would help us plan our reading better. Sincerely, Planning Peter"
      },
      {
        "category": "Services & Facilities",
        "subcategory": "Online reservation",
        "feedback": "Hello, I wanted to commend you on the new feature that allows us to choose our pickup location for reserved items. It's made the reservation process much more convenient. However, could you consider extending the pickup window from 7 to 10 days? Thanks, Grateful Grace"
      },
      {
        "category": "Services & Facilities",
        "subcategory": "Others",
        "feedback": "Dear Library Administration, I recently noticed that the library doesn't have a water fountain. Given Singapore's hot climate, it would be great to have a place to refill water bottles. Could you consider installing one? It would greatly enhance patron comfort. Thank you, Thirsty Theo"
      },
      {
        "category": "Services & Facilities",
        "subcategory": "Others",
        "feedback": "To whom it may concern, I wanted to suggest implementing a book recommendation service. It could be a great way for patrons to discover new reads based on their preferences. Perhaps this could be done through a short questionnaire or based on borrowing history? Best regards, Discovery Diane"
      },
      {
        "category": "Services & Facilities",
        "subcategory": "Photocopying services",
        "feedback": "Hello Library Staff, I appreciate the availability of photocopying services, but I've noticed that the machines often run out of paper or toner. Could you implement a system to check and refill these more regularly? It would save a lot of frustration for users. Thank you, Researcher Rachel"
      },
      {
        "category": "Services & Facilities",
        "subcategory": "Photocopying services",
        "feedback": "Dear Sir/Madam, The recent upgrade to color photocopying machines is great, but I've found the cost per page quite high. Would it be possible to introduce a loyalty program or bulk discount for frequent users? This would be very helpful for students like me. Sincerely, Budget-conscious Ben"
      },
      {
        "category": "Services & Facilities",
        "subcategory": "Powerpoint outlets",
        "feedback": "To the Library Management, I've noticed that there aren't enough power outlets near the study areas, especially for laptop users. Could you consider adding more outlets or even USB charging ports? This would greatly improve the studying experience. Thank you, Power-hungry Paul"
      },
      {
        "category": "Services & Facilities",
        "subcategory": "Powerpoint outlets",
        "feedback": "Hello, I wanted to commend you on the recent addition of power banks for loan. It's been a lifesaver when all the outlets are occupied. However, could you consider extending the loan period from 2 hours to 3? Sometimes that extra hour would be really helpful. Best wishes, Grateful Gina"
      },
      {
        "category": "Services & Facilities",
        "subcategory": "Reference services",
        "feedback": "Dear Library Team, I recently used the online chat reference service and found it incredibly helpful. The librarian was knowledgeable and patient. However, I noticed the service is only available during limited hours. Could you consider extending these hours? It would be very beneficial for those who work late. Regards, Night Owl Nick"
      },
      {
        "category": "Services & Facilities",
        "subcategory": "Reference services",
        "feedback": "To whom it may concern, While I appreciate the reference services provided, I've noticed that the wait times can be quite long during peak hours. Would it be possible to implement a queue system or increase staffing during these times? This would greatly improve the user experience. Thank you, Patient Patty"
      },
      {
        "category": "Services & Facilities",
        "subcategory": "Reminder services",
        "feedback": "Hello Library Management, I find the SMS reminder service for due dates very helpful. However, I've noticed that sometimes the reminders come quite late, leaving little time to return or renew books. Could you consider sending these reminders a few days earlier? This would help avoid overdue fines. Sincerely, Forgetful Fred"
      },
      {
        "category": "Services & Facilities",
        "subcategory": "Reminder services",
        "feedback": "Dear Sir/Madam, I wanted to suggest adding an option for email reminders in addition to SMS. Some patrons might prefer this method, and it would be helpful to have a written record of due dates. Also, could you include the titles of the books in the reminders? Thanks, Organized Olivia"
      },
      {
        "category": "Services & Facilities",
        "subcategory": "Reservation services - Others",
        "feedback": "To the Library Administration, I've noticed that the reservation system doesn't allow for bulk reservations. As a teacher, it would be incredibly helpful to be able to reserve multiple copies of a book for my class. Could you consider adding this feature? Thank you, Educator Emma"
      },
      {
        "category": "Services & Facilities",
        "subcategory": "Reservation services - Others",
        "feedback": "Hello, I wanted to suggest implementing a feature that notifies us when a reserved book becomes available at a nearer library branch. Sometimes I reserve a book at a faraway branch, not realizing it's available closer to home. This would save time and travel. Best regards, Efficient Eric"
      },
      {
        "category": "Services & Facilities",
        "subcategory": "Reservation services - Reservation Lockers",
        "feedback": "Dear Library Staff, The reservation lockers are a great addition, but I've noticed that they're often full, especially on weekends. Could you consider adding more lockers or implementing a time limit for pickup? This would ensure more patrons can benefit from this convenient service. Sincerely, Waiting Walter"
      },
      {
        "category": "Services & Facilities",
        "subcategory": "Reservation services - Reservation Lockers",
        "feedback": "To whom it may concern, I love the convenience of the reservation lockers, but I've had issues with the touchscreen interface. Sometimes it's unresponsive, making it difficult to retrieve my books. Could you please look into upgrading or maintaining these screens? Thank you, Frustrated Fiona"
      },
      {
        "category": "Services & Facilities",
        "subcategory": "Scanning services",
        "feedback": "Dear Library Management, I recently used the scanning services at the library and was impressed by the ease of use. However, I noticed that the scanner's resolution was quite low, making it difficult to read small text in some documents. Could you consider upgrading to higher resolution scanners? This would greatly improve the quality of scans, especially for research purposes. Thank you for your attention to this matter. Best regards, Researcher Rachel"
      },
      {
        "category": "Services & Facilities",
        "subcategory": "Scanning services",
        "feedback": "Hello Library Team, I appreciate the availability of scanning services, but I've encountered an issue with saving scanned documents. The current system only allows saving to USB drives, which I often forget to bring. Would it be possible to implement a feature that allows us to email scanned documents directly to ourselves? This would make the service much more convenient for patrons like me who rely on digital copies. Thank you for considering this suggestion. Sincerely, Tech-Savvy Tom"
      },
      {
        "category": "Services & Facilities",
        "subcategory": "Wireless Internet services",
        "feedback": "To whom it may concern, I'm a regular user of the library's wireless internet service and have generally found it reliable. However, I've noticed that during peak hours, the connection speed significantly drops. This makes it challenging to conduct research or work on online projects. Could you look into increasing the bandwidth or implementing a fair usage policy to ensure consistent speeds for all users? Your attention to this matter would be greatly appreciated. Best wishes, Working Wendy"
      },
      {
        "category": "Services & Facilities",
        "subcategory": "Wireless Internet services",
        "feedback": "Dear Sir/Madam, I wanted to commend the library on providing free wireless internet services. It's a valuable resource for many patrons, including myself. However, I've encountered difficulties with the login process. The captive portal often fails to load, requiring multiple attempts to connect. Could you please look into simplifying the login process or implementing a 'remember device' feature? This would save time and reduce frustration for frequent visitors. Thank you for your consideration. Regards, Frequent Visitor Fred"
      }
    ]
  }